Repository: AviGawande/hyperswitch-woocommerce-plugin
Catalog: locale/languages/*/hyperswitch-checkout-*.po
Languages: es_es

source: Hyperswitch Checkout for WooCommerce
es_es: Hyperswitch Checkout para WooCommerce

source: Hyperswitch checkout plugin for WooCommerce
es_es: Plugin de pago Hyperswitch para WooCommerce

source: Allow customers to securely pay via Hyperswitch
es_es: Permitir a los clientes pagar de forma segura a través de Hyperswitch

source: Settings
es_es: Ajustes

source: Capture Payment with Hyperswitch
es_es: Capturar pago con Hyperswitch

source: Sync Payment with Hyperswitch
es_es: Sincronizar pago con Hyperswitch

source: Synced Payment Status (Hyperswitch Payment ID: %s)
es_es: Estado de pago sincronizado (ID de pago de Hyperswitch: %s)

source: Payment successful via %1$s (Hyperswitch Payment ID: %2$s)
es_es: Pago exitoso a través de %1$s (ID de pago de Hyperswitch: %2$s)

source: Payment processing via %1$s (Hyperswitch Payment ID: %2$s)
es_es: Procesando pago a través de %1$s (ID de pago de Hyperswitch: %2$s)

source: Payment failed via %1$s (Hyperswitch Payment ID: %2$s)
es_es: Pago fallido a través de %1$s (ID de pago de Hyperswitch: %2$s)

source: Enable/Disable
es_es: Activar/Desactivar

source: Enable Hyperswitch
es_es: Activar Hyperswitch

source: Title
es_es: Título

source: The title to be displayed for Hyperswitch Payment Method (in case of multiple WooCommerce Payment Gateways/ Methods)
es_es: El título que se mostrará para el método de pago Hyperswitch (en caso de múltiples pasarelas/métodos de pago de WooCommerce)

source: Credit, Debit Card and Wallet Payments (powered by Hyperswitch)
es_es: Pagos con tarjeta de crédito, débito y billetera (impulsado por Hyperswitch)

source: Environment
es_es: Entorno

source: Select Environment
es_es: Seleccionar entorno

source: Production
es_es: Producción

source: Api Key
es_es: Clave API

source: Find this on Developers > API Keys section of Hyperswitch Dashboard
es_es: Encuentre esto en la sección Desarrolladores > Claves API del Panel de Control de Hyperswitch

source: Publishable key
es_es: Clave publicable

source: Payment Response Hash Key
es_es: Clave Hash de respuesta de pago

source: Business Profile ID
es_es: ID de perfil de negocio

source: Find this on Settings > Business profiles section of Hyperswitch Dashboard
es_es: Encuentre esto en la sección Ajustes > Perfiles de negocio del Panel de Control de Hyperswitch

source: Enable Webhook
es_es: Activar Webhook

source: Allow webhooks from Hyperswitch to receive real time updates of payments to update orders.<br/><br/><span>%s</span><br/><br/>Use this URL to be entered as Webhook URL on Hyperswitch dashboard
es_es: Permitir webhooks de Hyperswitch para recibir actualizaciones en tiempo real de pagos para actualizar pedidos.<br/><br/><span>%s</span><br/><br/>Use esta URL para ingresarla como URL de Webhook en el panel de Hyperswitch

source: Enable Hyperswitch Webhook
es_es: Activar Webhook de Hyperswitch

source: Capture Method
es_es: Método de captura

source: Select Capture Method
es_es: Seleccionar método de captura

source: Specify whether you want to capture payments manually or automatically
es_es: Especifique si desea capturar pagos manual o automáticamente

source: Automatic
es_es: Automático

source: Enable Saved Payment Methods
es_es: Activar métodos de pago guardados

source: Allow registered customers to pay via saved payment methods
es_es: Permitir a los clientes registrados pagar mediante métodos de pago guardados

source: Show Card Form Always
es_es: Mostrar formulario de tarjeta siempre

source: Show Card Form before Payment Methods List has loaded
es_es: Mostrar formulario de tarjeta antes de que se cargue la lista de métodos de pago

source: Appearance
es_es: Apariencia

source: Use the above parameter to pass appearance config (in json format) to the checkout.
es_es: Use el parámetro anterior para pasar la configuración de apariencia (en formato json) al checkout.

source: Layout
es_es: Diseño

source: Select Layout
es_es: Seleccionar diseño

source: Choose a layout that fits well with your UI pattern.
es_es: Elija un diseño que se adapte bien a su patrón de interfaz de usuario.

source: Tabs
es_es: Pestañas

source: Accordion
es_es: Acordeón

source: Spaced Accordion
es_es: Acordeón espaciado

source: Hold Order on Processing Payments
es_es: Retener pedido en pagos en procesamiento

source: Disable this only if you do not want to reduce stock levels until the payment is successful.
es_es: Desactive esto solo si no desea reducir los niveles de stock hasta que el pago sea exitoso.

source: Whether to hold order, reduce stock if a payment goes into processing status.
es_es: Si retener el pedido y reducir el stock si un pago entra en estado de procesamiento.

source: Unable to Create Hyperswitch Payment Intent.
es_es: No se puede crear la intención de pago de Hyperswitch.

source: Something went wrong. Please contact support for assistance.
es_es: Algo salió mal. Por favor, contacte con soporte para obtener ayuda.

source: Customer created via Woocommerce Application
es_es: Cliente creado a través de la aplicación Woocommerce

source: Thank you for shopping with us. However, the transaction has been declined.
es_es: Gracias por comprar con nosotros. Sin embargo, la transacción ha sido rechazada.

source: Payment authorized via %1$s (Hyperswitch Payment ID: %2$s). Note: Requires Capture
es_es: Pago autorizado a través de %1$s (ID de pago de Hyperswitch: %2$s). Nota: Requiere captura

source: Payment failed via %1$s (Hyperswitch Payment ID: %2$s) with error message: %3$s
es_es: Pago fallido a través de %1$s (ID de pago de Hyperswitch: %2$s) con mensaje de error: %3$s

source: Thank you for shopping with us. However, the payment has failed. Please retry the payment.
es_es: Gracias por comprar con nosotros. Sin embargo, el pago ha fallado. Por favor, intente el pago nuevamente.

source: Something went wrong. Please try again or reload the page.
es_es: Algo salió mal. Por favor, intente nuevamente o recargue la página.
